# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    rank.py                                            :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: jchris <jchris@student.42tokyo.jp>         +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2023/06/05 00:58:07 by jchris            #+#    #+#              #
#    Updated: 2023/06/05 00:58:08 by jchris           ###   ########.fr        #
#                                                                              #
# **************************************************************************** #


import csv


def make_csv(lists):
    csv_path = "test.csv"
    with open(csv_path, 'w', newline='') as file:
        writer = csv.writer(file)
        writer.writerow(["順位", "名前", "滞在時間", "in回数", "平均滞在時間"])
        for list in lists:
            idx = list[2].index('h')
            minute = int(list[2][:idx]) * 60 + int(list[2][idx + 1: -1])
            minute //= list[3]
            list.append(f"{minute // 60}h {minute % 60}m")
            writer.writerow(list)


lists = [[1, "ちきん", "330h 25m", 41],
         [2, "Justin", "313h 7m", 43],
         [3, "全て歌詞の所為です。", "284h 44m", 20],
         [4, "ハナチャン", "259h 46m", 34],
         [5, "Konjikun(アレン)", "251h 37m", 31],
         [6, "こんぶ帝", "174h 29m", 21],
         [7, "コノハズク", "167h 21m", 21],
         [8, "taishi", "162h 41m", 38],
         [9, "かんばら", "126h 30m", 22],
         [10, "超トゲp", "112h 29m", 26],
         [11, "かまぼこ", "104h 25m", 28],
         [12, "試作K", "81h 8m", 16],
         [13, "みと", "70h 10m", 23],
         [14, "あっしー", "62h 19m", 14],
         [15, "えさだ", "49h 54m", 20],
         [16, "ののすけ", "46h 55m", 12],
         [17, "しのてぃ", "44h 18m", 12],
         [18, "Tatsuki", "41h 30m", 9],
         [19, "たっくそ", "37h 3m", 7],
         [20, "おぎゅ", "36h 32m", 11],
         [21, "North", "35h 41m", 7],
         [22, "toganin", "35h 9m", 7],
         [23, "ゆうた", "35h 6m", 12],
         [24, "So", "34h 18m", 12],
         [25, "haru", "31h 17m", 3],
         [26, "ふりゃ", "29h 48m", 9],
         [27, "あくろ", "28h 54m", 7],
         [28, "すすす", "27h 38m", 12],
         [29, "nanasi", "27h 37m", 12],
         [30, "よつや", "26h 27m", 6],
         [31, "sota", "25h 39m", 8],
         [32, "るあ", "25h 32m", 4],
         [33, "らー", "24h 50m", 8],
         [34, "しょーご", "24h 36m", 7],
         [35, "しこー", "24h 14m", 7],
         [36, "NaClaq", "23h 39m", 5],
         [37, "あぱしぃ", "23h 16m", 4],
         [38, "Michi", "20h 47m", 9],
         [39, "すすむ", "19h 22m", 3],
         [40, "猫月nano", "19h 11m", 8],
         [41, "こと", "18h 51m", 4],
         [42, "カプチーノ3", "16h 44m", 5],
         [43, "れんれん", "15h 24m", 5],
         [44, "shion", "14h 40m", 7],
         [45, "そら", "13h 44m", 6],
         [46, "啓斗", "13h 33m", 5],
         [47, "とだみ", "12h 55m", 4],
         [48, "ぼぶ", "12h 49m", 4],
         [49, "atom", "12h 37m", 3],
         [50, "keeta", "12h 14m", 3],
         [51, "maito", "11h 36m", 2],
         [52, "しろまんだ", "11h 17m", 4],
         [53, "kz", "11h 16m", 4],
         [54, "MIYABI", "11h 13m", 6],
         [55, "レイ", "11h 12m", 5],
         [56, "しほ", "9h 55m", 4],
         [57, "Hibiki", "9h 48m", 3],
         [58, "バル", "9h 42m", 3],
         [59, "ああああ", "9h 31m", 4],
         [60, "umekombu_dayo", "8h 53m", 4],
         [61, "ごんざぶろう", "7h 55m", 3],
         [62, "よも", "7h 22m", 3],
         [63, "ゆ〜い", "7h 13m", 4],
         [64, "しゅんや", "7h 9m", 3],
         [65, "すりー", "6h 19m", 2],
         [66, "kaito0124", "6h 10m", 2],
         [67, "もずく", "5h 51m", 3],
         [68, "tsub", "5h 41m", 4],
         [69, "ふぐそん", "5h 25m", 3],
         [70, "ふぐる。", "5h 25m", 2],
         [71, "しらけー", "4h 54m", 3],
         [72, "yukihiro", "4h 46m", 2],
         [73, "ねふじ", "4h 29m", 3],
         [74, "さとしょー", "4h 26m", 2],
         [75, "もりこう", "4h 25m", 2],
         [76, "ひらこ", "4h 18m", 1],
         [77, "ryo", "3h 54m", 2],
         [78, "まないた", "3h 49m", 2],
         [79, "ip4.0", "3h 34m", 2],
         [80, "そうま", "3h 32m", 2],
         [81, "kaho", "3h 32m", 1],
         [82, "平山大智　1f10220069", "3h 28m", 2],
         [83, "かなざー", "3h 4m", 2],
         [84, "ゆーや", "2h 46m", 2],
         [85, "シナモン", "2h 15m", 1],
         [86, "zassou", "2h 11m", 2],
         [87, "りと", "1h 43m", 1],
         [88, "Teru", "1h 35m", 2],
         [89, "ハム", "1h 28m", 2],
         [90, "ミヤザキ", "0h 52m", 2],
         [91, "Hoshy", "0h 36m", 1],
         [92, "檸檬", "0h 22m", 1],
         [93, "たくま", "0h 19m", 1],
         [94, "nari", "0h 10m", 1]]

make_csv(lists)
